# Exercise 119: Dealing Hands of Cards

'''
(* 44 라인 *)

많은 카드 게임에서 덱이 뒤섞인 후 각 플레이어는 특정 수의 카드를받습니다.
손의 수, 한 손에 든 카드 수 및 카드 한 벌을 세 가지 매개 변수로 사용하는 함수 거래를 작성하십시오.
함수는 처리 된 모든 손을 포함하는 목록을 반환해야합니다. 각 핸드는 카드 목록으로 표시됩니다.

손을 다룰 때, 플레이어의 손에 추가 될 때 카드에서 카드 한 장을 제거하여, 카드로 전달 된 카드 데크를 매개 변수로 수정해야합니다.
카드를 처리 할 때, 플레이어가 추가 카드를 받기 전에 각 플레이어에게 카드를주는 것이 일반적입니다.
플레이어의 손을 만들 때이 기능을 따라야합니다.

연습 문제 118에 대한 솔루션을 사용하여 한 벌의 카드를 만들어 섞은 다음 5 장씩 4 장씩 처리하는 주 프로그램을 구성하십시오.
카드를 모두 손에 넣은 후에 카드의 모든 카드를 덱에 남아있는 카드와 함께 표시하십시오.
'''

'''
1. 함수 사용
2. 이게뭔소리야
'''

